---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotIntegrate
source: html/14063952-52cc-bc54-2716-3266f44ff7b3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotIntegrate Property

In order to restore an element's 'Constrain to Massing' property to 'Dependent', it must be in the main model with the massing.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotIntegrate { get; }
```